artillery/loadTesting.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 100
  defaults:
    headers:
      content-type: "application/json"
  variables:
    productid:
      - "1"
    questionid:
      - "5"
    answerid:
      - "3522866"
scenarios:
  - name: "Get Questions"
    flow:
      - get:
          url: "/qa/{{ productid }}/questions"
      - think: 3
  - name: "Add Questions"
    flow:
      - post:
          url: "/qa/{{ productid }}"
          json:
            body: "Is this api working?"
            name: "ApiGuy"
            email: "api@email.com"
  - name: "Update Questions (helpful)"
    flow:
      - put:
          url: "/qa/question/{{questionid}}/helpful"
  - name: "Update Questions (report)"
    flow:
      - put:
          url: "/qa/question/{{questionid}}/report"
  - name: "Add Answer"
    flow:
      - post:
          url: "/qa/{{ answerid }}/answers"
          json:
            body: "Is this api working?"
            name: "ApiGuy"
            email: "api@email.com"
            photos:
              - "https://images.unsplash.com/photo-1530519729491-aea5b51d1ee1?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1651&q=80"
              - "https://images.unsplash.com/photo-1511127088257-53ccfcc769fa?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1650&q=80"
              - "https://images.unsplash.com/photo-1500603720222-eb7a1f997356?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1653&q=80"
  - name: "Update Answer (helpful)"
    flow:
      - put:
          url: "/qa/answer/{{answerid}}/helpful"
  - name: "Update Answer (report)"
    flow:
      - put:
          url: "/qa/answer/{{answerid}}/report"